{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_1", "unit_forget_bias": true, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "trainable": true, "bias_constraint": null, "units": 25, "kernel_regularizer": null, "use_bias": true, "stateful": false, "dtype": "float32", "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 168, 1], "implementation": 1, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activation": "tanh", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "backend": "tensorflow"}